Repository: pikougi-nabot/epochrefs-old
Catalog: commit/84000/data-translation-memory/toh44-45_84000-the-stem-array.tmx/chapters-43-53.tmx
Source language: bo
Languages: en

source: །ཆོས་ཐམས་ཅད་ལ་ནན་ཏན་དུ་བྱེད་པས་ཆོས་ཐམས་ཅད་དང་མཉམ་པར་བསྟན་ཏོ།
en: it manifests equally in all Dharmas because it is the practice of all Dharmas;

source: །ཞིང་ཐམས་ཅད་ཡོངས་སུ་དག་པར་བྱེད་པས་ཞིང་ཐམས་ཅད་དང་མཉམ་པར་བསྟན་ཏོ།
en: it manifests equally in all realms because it purifies all realms;

source: །སྨོན་ལམ་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པར་བྱེད་པས། སྨོན་ལམ་ཐམས་ཅད་དང་མཉམ་པར་བསྟན་ཏོ། །སངས་རྒྱས་ཐམས་ཅད་མཆོད་པ་མངོན་པར་བསྒྲུབ་པས།
en: it manifests equally in all prayers because it fulfills all prayers;

source: སངས་རྒྱས་ཐམས་ཅད་དང་མཉམ་པར་བསྟན་ཏོ། །བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱི་སྨོན་ལམ་དང་གཅིག་ཏུ་འགྱུར་བའི་ཕྱིར།
en: it manifests equally to all buddhas because it is the accomplishment of making offerings to all buddhas;

source: བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་དང་མཉམ་པར་བསྟན་ཏོ། །དགེ་བའི་བཤེས་གཉེན་ཐམས་ཅད་ལ་བསྙེན་བཀུར་བྱེད་པའི་ཕྱིར།
en: it manifests equally in all bodhisattvas because it is the one prayer of all bodhisattvas;

source: བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སྤྱོད་པ་ནི་དགེ་བའི་བཤེས་གཉེན་ཐམས་ཅད་དང་མཉམ་པར་བསྟན་ཏོ།
en: and it manifests equally to all kalyāṇamitras because it serves all kalyāṇamitras.

source: །རིགས་ཀྱི་བུ་དེ་བས་ན་ཁྱོད་ཀྱིས་དགེ་བའི་བཤེས་གཉེན་ཡོངས་སུ་བཙལ་བ་ལ་སྐྱོ་བར་མི་བྱའོ།
en: “Therefore, noble one, never weary of seeking for kalyāṇamitras!

source: །དགེ་བའི་བཤེས་གཉེན་མཐོང་བས་ངོམས་པ་བསྐྱེད་པར་མི་བྱའོ།
en: Never feel you have had enough of seeing kalyāṇamitras!

source: །དགེ་བའི་བཤེས་གཉེན་ལ་ཡོངས་སུ་དྲི་བས་ཆོག་ཤེས་པར་མི་བྱའོ།
en: Never feel you no longer need to ask questions of kalyāṇamitras!

source: །དགེ་བའི་བཤེས་གཉེན་དང་འགྲོགས་པ་ལས་བསམ་པ་ཕྱིར་ལྡོག་པར་མི་བྱའོ།
en: Never turn your thoughts away from being with kalyāṇamitras!

source: །དགེ་བའི་བཤེས་གཉེན་ལ་ཕུ་དུད་དང་། རིམ་གྲོའི་སྦྱོར་བ་རྒྱུན་གཅད་པར་མི་བྱའོ།
en: Never cease from revering and venerating kalyāṇamitras!

source: །དགེ་བའི་བཤེས་གཉེན་གྱི་གདམས་ངག་དང་། རྗེས་སུ་བསྟན་པ་ལ་ལོག་པར་གཟུང་བར་མི་བྱའོ།
en: Never maintain the instructions and teachings of the kalyāṇamitras incorrectly!

source: །དགེ་བའི་བཤེས་གཉེན་གྱི་ཡོན་ཏན་ཐོབ་པར་འགྱུར་བ་ལ་ཐེ་ཚོམ་མི་བསྐྱེད་དོ།
en: Never have doubts concerning the attainment of the qualities of the kalyāṇamitras!

source: །དགེ་བའི་བཤེས་གཉེན་གྱིས་འབྱུང་བའི་སྒོ་བསྟན་པ་ལ་ཡིད་གཉིས་སུ་མི་བྱའོ།
en: Never have uncertainty concerning the teaching of gateways that have been brought forth by the kalyāṇamitras!

source: །དགེ་བའི་བཤེས་གཉེན་གྱི་ཐབས་ཀྱི་བསམ་པ་དང་། འཇིག་རྟེན་གྱི་རྗེས་སུ་འབྲང་བར་བྱ་བའི་རྒྱུད་ལ་ཞེ་སྡང་བསྐྱེད་པར་མི་བྱའོ།
en: Never have anger toward the following of worldly ways through the use of methods by kalyāṇamitras!

source: །དགེ་བའི་བཤེས་གཉེན་ལ་མོས་པ་རྣམ་པར་བསྐྱེད་པས་ལུས་དང་སེམས་རྣམ་པར་ལྡོག་པར་མི་བྱའོ།
en: Never let your mind and body deviate from the development of adoration for the kalyāṇamitras!

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ཐམས་ཅད་ཐོས་པ་ནི་དགེ་བའི་བཤེས་གཉེན་ལ་རག་ལས་པའོ།
en: Noble one, hearing of all the bodhisattva conducts of bodhisattvas is dependent on the kalyāṇamitras.

source: །བྱང་ཆུབ་སེམས་དཔའི་ཡོན་ཏན་ཡོངས་སུ་རྫོགས་པར་བྱ་བ་ཐམས་ཅད་ནི་དགེ་བའི་བཤེས་གཉེན་ལས་བྱུང་བའོ། །བྱང་ཆུབ་སེམས་དཔའི་སྨོན་ལམ་གྱི་རྒྱུན་ཐམས་ཅད་ནི་དགེ་བའི་བཤེས་གཉེན་ལས་བྱུང་བའོ།
en: All the completion of the qualities of a bodhisattva comes from the kalyāṇamitras. All the continuation of bodhisattva prayers comes from the kalyāṇamitras.

source: །བྱང་ཆུབ་སེམས་དཔའི་དགེ་བའི་རྩ་བ་ཐམས་ཅད་ནི་དགེ་བའི་བཤེས་གཉེན་གྱིས་བསྐྱེད་པའོ། །བྱང་ཆུབ་སེམས་དཔའི་ཚོགས་ཐམས་ཅད་ནི་དགེ་བའི་བཤེས་གཉེན་གྱིས་བསྒྲུབས་པའོ།
en: All the roots of merit of a bodhisattva are created by the kalyāṇamitras. All the accumulations of a bodhisattva are accomplished by the kalyāṇamitras.

source: །བྱང་ཆུབ་སེམས་དཔའི་ཆོས་ཀྱི་སྒོ་སྣང་བ་ཐམས་ཅད་ནི་དགེ་བའི་བཤེས་གཉེན་ལས་བྱུང་བའོ།
en: All the lights from the Dharma doors of the bodhisattvas come from the kalyāṇamitras.

source: །བྱང་ཆུབ་སེམས་དཔའི་འབྱུང་བའི་སྒོ་རྣམ་པར་དག་པ་ཐམས་ཅད་ནི་དགེ་བའི་བཤེས་གཉེན་ལས་བྱུང་བའོ།
en: All the pure doors of the setting-forth of bodhisattvas come from the kalyāṇamitras.

source: །བྱང་ཆུབ་སེམས་དཔའི་བསླབ་པ་ལ་ནན་ཏན་དུ་བྱ་བ་ཐམས་ཅད་ནི་དགེ་བའི་བཤེས་གཉེན་ལ་རག་ལས་པའོ། །བྱང་ཆུབ་སེམས་དཔའི་ཡོན་ཏན་གྱི་ཆོས་ཐམས་ཅད་ནི་དགེ་བའི་བཤེས་གཉེན་ལ་གནས་པའོ།
en: All the practices of bodhisattva training are dependent on the kalyāṇamitras. All the phenomena of the qualities of bodhisattvas rely on the kalyāṇamitras.

source: །བྱང་ཆུབ་སེམས་དཔའི་ལྷག་པའི་བསམ་པ་ཡོངས་སུ་དག་པ་ཐམས་ཅད་ནི་དགེ་བའི་བཤེས་གཉེན་རྩ་བར་གྱུར་པའོ།
en: All the pure higher motivations of bodhisattvas have the kalyāṇamitras as their roots.

source: །བྱང་ཆུབ་སེམས་དཔའི་སེམས་བསྐྱེད་པ་བརྟན་པ་ཐམས་ཅད་ནི་དགེ་བའི་བཤེས་གཉེན་ལས་སྐྱེས་པའོ།
en: All the firm developments of the aspiration to enlightenment of the bodhisattvas arise from the kalyāṇamitras.

source: །བྱང་ཆུབ་སེམས་དཔའི་གཟུངས་དང་སྤོབས་པའི་སྒོ་སྣང་བ་ཐམས་ཅད་དུ་ཁྲིད་པ་ནི་དགེ་བའི་བཤེས་གཉེན་ནོ།
en: The kalyāṇamitras are the guides to all the light from the doors to the mental retention and eloquence of bodhisattvas.

source: །བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་དག་པའི་སྒོའི་མཛོད་ཐམས་ཅད་ནི་དགེ་བའི་བཤེས་གཉེན་གྱིས་ཡོངས་སུ་བཟུང་བའོ།
en: The kalyāṇamitras possess all the treasures of the doors to the purity of the bodhisattvas.

source: །བྱང་ཆུབ་སེམས་དཔའི་ཡེ་ཤེས་སྣང་བ་ཐམས་ཅད་ནི་དགེ་བའི་བཤེས་གཉེན་གྱིས་ཡང་དག་པར་བསྐྱེད་པའོ།
en: The kalyāṇamitras give rise to all the light of the knowledge of the bodhisattvas.

source: །བྱང་ཆུབ་སེམས་དཔའི་སྨོན་ལམ་ཁྱད་པར་ཅན་ཐམས་ཅད་ནི་དགེ་བའི་བཤེས་གཉེན་གྱི་ལག་ན་འདུག་པའོ།
en: The kalyāṇamitras hold in their hands all the special prayers of the bodhisattvas.

source: །བྱང་ཆུབ་སེམས་དཔའི་སྨོན་ལམ་གྱི་ཚུལ་གྱི་རྒྱུད་གཅིག་ཏུ་གྱུར་པ་ཐམས་ཅད་ནི་དགེ་བའི་བཤེས་གཉེན་ལ་བརྟེན་པའོ།
en: The single family of the way of the prayers of bodhisattvas is dependent on the kalyāṇamitras.

source: །བྱང་ཆུབ་སེམས་དཔའི་ཡང་དག་པར་བསྒྲུབ་པ་ཁྱད་པར་ཅན་མཉམ་པ་ཐམས་ཅད་ནི་དགེ་བའི་བཤེས་གཉེན་གྱི་རྒྱུད་ལས་བྱུང་བའོ།
en: The equality of all the special accomplishments of the bodhisattvas comes from the family of the kalyāṇamitras.

source: །བྱང་ཆུབ་སེམས་དཔའི་གསང་བའི་གནས་ཐམས་ཅད་ནི་དགེ་བའི་བཤེས་གཉེན་གྱི་མཛོད་ན་འདུག་པའོ།
en: All the secret states of the bodhisattvas are in the treasury of the kalyāṇamitras.

source: །བྱང་ཆུབ་སེམས་དཔའི་ཆོས་ཐམས་ཅད་ནི་དགེ་བའི་བཤེས་གཉེན་གྱི་འབྱུང་གནས་ནས་བྱུང་བའོ། །བྱང་ཆུབ་སེམས་དཔའི་དབང་པོའི་ཤུགས་ཀྱི་མྱུ་གུ་ཐམས་ཅད་ནི་དགེ་བའི་བཤེས་གཉེན་གྱིས་རྣམ་པར་སྤེལ་བའོ།
en: All the qualities of the bodhisattvas originate in the kalyāṇamitras. All the seedlings of the force of the power of bodhisattvas are increased by the kalyāṇamitras.

source: །བྱང་ཆུབ་སེམས་དཔའི་ཡེ་ཤེས་རྒྱ་མཚོ་ཐམས་ཅད་ནི་དགེ་བའི་བཤེས་གཉེན་གྱིས་ཡང་དག་པར་སྤེལ་བའོ།
en: All the oceans of wisdom of the bodhisattvas are increased by the kalyāṇamitras.

source: །བྱང་ཆུབ་སེམས་དཔའི་གཏེར་གྱི་མཛོད་ཐམས་ཅད་ནི་དགེ་བའི་བཤེས་གཉེན་གྱིས་ཡོངས་སུ་བསྐྱངས་པའོ། །བྱང་ཆུབ་སེམས་དཔའི་བསོད་ནམས་བསྩགས་པ་ཐམས་ཅད་ནི་དགེ་བའི་བཤེས་གཉེན་གྱིས་བསྲུངས་པའོ།
en: All the treasuries of the wealth of the bodhisattvas are protected by the kalyāṇamitras. All the accumulations of merit of the bodhisattvas are guarded by the kalyāṇamitras.

source: །བྱང་ཆུབ་སེམས་དཔའི་ཚེ་རྣམ་པར་དག་པ་ཐམས་ཅད་ནི་དགེ་བའི་བཤེས་གཉེན་གྱིས་བསྐྱེད་པའོ། །བྱང་ཆུབ་སེམས་དཔའི་ཆོས་མཉན་པའི་སྤྲིན་ཐམས་ཅད་ནི་དགེ་བའི་བཤེས་གཉེན་གྱི་ཁ་ནས་བྱུང་བའོ།
en: All the pure lifetimes of the bodhisattvas are created by the kalyāṇamitras. All the clouds of Dharma heard by the bodhisattvas come from the mouths of the kalyāṇamitras.

source: །བྱང་ཆུབ་སེམས་དཔའ་འབྱུང་བའི་ལམ་ལ་འཇུག་པ་ཐམས་ཅད་ནི་དགེ་བའི་བཤེས་གཉེན་གྱི་ཁོང་ན་ཡོད་པའོ།
en: All the paths of setting forth entered by the bodhisattvas are within the kalyāṇamitras.

source: །སངས་རྒྱས་ཐམས་ཅད་ཀྱི་བྱང་ཆུབ་ནི་དགེ་བའི་བཤེས་གཉེན་ལ་རིམ་གྲོ་བྱས་པས་ཐོབ་པའོ།
en: All the enlightenments of the buddhas are attained through venerating the kalyāṇamitras.

source: །བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ཐམས་ཅད་ནི་དགེ་བའི་བཤེས་གཉེན་གྱིས་ཡོངས་སུ་བཟུང་བའོ།
en: All the conducts of the bodhisattvas are possessed by the kalyāṇamitras.

source: །བྱང་ཆུབ་སེམས་དཔའི་ཡོན་ཏན་བརྗོད་པ་ཐམས་ཅད་ནི་དགེ་བའི་བཤེས་གཉེན་གྱིས་བསྟན་པའོ། །བྱང་ཆུབ་སེམས་དཔའི་ཆོས་ཀྱི་ཕྱོགས་ཀྱི་རྗེས་སུ་འབྲང་བ་ཐམས་ཅད་ནི་དགེ་བའི་བཤེས་གཉེན་གྱིས་ཡོངས་སུ་བསྟན་པའོ།
en: All the descriptions of the qualities of bodhisattvas are taught by the kalyāṇamitras. All following the direction of the Dharma by bodhisattvas is taught by the kalyāṇamitras.

source: །བྱང་ཆུབ་སེམས་དཔའི་སེམས་དང་ལྷག་པའི་བསམ་པའི་བདག་ཉིད་ཆེ་བ་ནི་དགེ་བའི་བཤེས་གཉེན་གྱིས་ཡང་དག་པར་བརྗོད་པའོ།
en: All the greatness of the aspirations and superior motivations of bodhisattvas is described by the kalyāṇamitras.

source: །བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་བྱམས་པ་ཆེན་པོའི་སྟོབས་ནི་དགེ་བའི་བཤེས་གཉེན་ལས་བྱུང་བའོ།
en: All the strength of the great love of the bodhisattvas comes from the kalyāṇamitras.

source: །བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སྙིང་རྗེ་ཆེན་པོའི་སྟོབས་ནི་དགེ་བའི་བཤེས་གཉེན་གྱིས་བསྐྱེད་པའོ།
en: All the strength of the great compassion of the bodhisattvas is created by the kalyāṇamitras.

source: །བྱང་ཆུབ་སེམས་དཔའི་དབང་ཐམས་ཅད་ནི་དགེ་བའི་བཤེས་གཉེན་གྱིས་ཡོངས་སུ་བཟུང་བའོ།
en: All the powers of the bodhisattvas are possessed by the kalyāṇamitras.

source: །བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཡན་ལག་ཐམས་ཅད་ནི་དགེ་བའི་བཤེས་གཉེན་གྱིས་བསྐྱེད་པའོ།
en: All the aspects of the bodhisattvas are created by the kalyāṇamitras.

source: །བྱང་ཆུབ་སེམས་དཔའི་ཕན་པ་ཉེ་བར་བསྒྲུབ་པ་ཐམས་ཅད་ནི་དགེ་བའི་བཤེས་གཉེན་ལས་བྱུང་བའོ།
en: All the benefits accomplished by the bodhisattvas come from the kalyāṇamitras.

source: །རིགས་ཀྱི་བུ་དགེ་བའི་བཤེས་གཉེན་གྱིས་ཡང་དག་པར་ཟིན་པའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ནི་ངན་སོང་དུ་མི་ལྟུང་ངོ་།
en: “Noble one, the bodhisattvas cared for by the kalyāṇamitras do not fall into the lower existences.

source: །དགེ་བའི་བཤེས་གཉེན་གྱིས་ཡོངས་སུ་བཟུང་བའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ནི་ཐེག་པ་ཆེན་པོ་ལས་མྱི་ལྡོག་གོ །དགེ་བའི་བཤེས་གཉེན་གྱིས་ཡོངས་སུ་བསམ་པའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ནི་བྱང་ཆུབ་སེམས་དཔའི་བསླབ་པ་དང་འགལ་བར་མྱི་བྱེད་དོ།
en: The bodhisattvas in the care of the kalyāṇamitras do not turn away from the Mahāyāna. The bodhisattvas who are in the thoughts of the kalyāṇamitras do not transgress the trainings.

source: །དགེ་བའི་བཤེས་གཉེན་གྱིས་ཤིན་ཏུ་བསྲུངས་པའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ནི་སྡིག་པའི་གྲོགས་པོའི་ལག་ཏུ་མྱི་འདོང་ངོ་།
en: The bodhisattvas guarded by kalyāṇamitras do not fall into the hands of bad companions.

source: །དགེ་བའི་བཤེས་གཉེན་གྱིས་ཡོངས་སུ་བསྐྱངས་པའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ནི་བྱང་ཆུབ་སེམས་དཔའི་ཆོས་ལས་ཉམས་པར་མི་འགྱུར་རོ།
en: The bodhisattvas protected by kalyāṇamitras do not lapse from the Dharma of the bodhisattvas.

source: །དགེ་བའི་བཤེས་གཉེན་གྱིས་ཡང་དག་པར་ཟིན་པའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ནི་སོ་སོའི་སྐྱེ་བོའི་ས་ལས་ཡོངས་སུ་འདའོ།
en: The bodhisattvas being cared for by kalyāṇamitras transcend the level of ordinary beings.

source: །དགེ་བའི་བཤེས་གཉེན་གྱིས་ཡོངས་སུ་བསྲུངས་པའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ནི་ཉན་ཐོས་དང་རང་སངས་རྒྱས་ཀྱི་སྐྱོན་མེད་པར་མི་འཇུག་གོ །དགེ་བའི་བཤེས་གཉེན་གྱིས་བསྐྱངས་པའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ནི་འཇིག་རྟེན་ལས་མངོན་པར་འཕགས་པ་ཡིན་ནོ།
en: The bodhisattvas guarded by kalyāṇamitras do not engage in the faults of the śrāvakas and pratyeka­buddhas. The bodhisattvas protected by kalyāṇamitras rise above the world.

source: །དགེ་བའི་བཤེས་གཉེན་གྱིས་ཡང་དག་པར་བསྐྱེད་པའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ནི་འཇིག་རྟེན་གྱི་ཆོས་ཀྱིས་མྱི་གོས་པ་ཡིན་ནོ།
en: The bodhisattvas created by kalyāṇamitras are unstained by worldly qualities.

source: །དགེ་བའི་བཤེས་གཉེན་བསྙེན་བཀུར་བའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ནི་སྤྱོད་པ་ཐམས་ཅད་ལ་མི་འཁྲུལ་པར་སྤྱོད་པ་ཡིན་ནོ།
en: The bodhisattvas who serve the kalyāṇamitras practice a conduct free of confusion.

source: །དགེ་བའི་བཤེས་གཉེན་གྱིས་བསྒྲུབས་པའི་བྱང་ཆུབ་སེམས་དཔའི་རྣམས་ནི་བརྩམ་པ་ཐམས་ཅད་ལས་ཕྱིར་མི་ལྡོག་གོ །དགེ་བའི་བཤེས་གཉེན་གྱིས་ཡོངས་སུ་བཟུང་བའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ནི་ལས་དང་ཉོན་མོངས་པས་ཐུབ་པར་དཀའ་བ་ཡིན་ནོ།
en: The bodhisattvas accomplished by kalyāṇamitras do not turn away from all undertakings. The bodhisattvas in the care of kalyāṇamitras are invincible to karma and kleśas.

source: །དགེ་བའི་བཤེས་གཉེན་གྱི་སྟོབས་ཀྱིས་བརྟན་པའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ནི་བདུད་ཐམས་ཅད་ཀྱིས་མི་ཐུབ་པ་ཡིན་ནོ།
en: The bodhisattvas who are reliant on the strength of the kalyāṇamitras are invulnerable to all māras.

source: །དགེ་བའི་བཤེས་གཉེན་གྱི་རྟེན་ལ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ནི་བྱང་ཆུབ་ཀྱི་ཡན་ལག་ཐམས་ཅད་ཀྱིས་རྣམ་པར་འཕེལ་ལོ།
en: The bodhisattvas who remain dependent on kalyāṇamitras increase all the aspects of enlightenment.

source: རིགས་ཀྱི་བུ་དགེ་བའི་བཤེས་གཉེན་ནི་བསྒྲིབ་པར་འགྱུར་བའི་ཆོས་ཐམས་ཅད་ལས་རྣམ་པར་སྦྱོང་བའོ།
en: Noble one, the kalyāṇamitras have purified all obscured qualities.

source: །དགེ་བའི་བཤེས་གཉེན་ནི་སྡིག་ཏོ་ལས་རྣམ་པར་བཟློག་པའོ།
en: The kalyāṇamitras have turned away from bad actions.

source: །དགེ་བའི་བཤེས་གཉེན་ནི་མི་བྱ་བ་རྣམས་ཁོང་དུ་ཆུད་པར་བྱེད་པའོ།
en: The kalyāṇamitras have understood what is not to be done.

source: །བག་མེད་པའི་གནས་ལས་ཡང་དག་པར་བཟློག་པའོ།
en: They have eliminated all states of carelessness.

source: །མ་རིག་པའི་མུན་པ་རྣམ་པར་སེལ་བའོ།
en: They have dispelled the darkness of ignorance.

source: །ལྟ་བའི་འཆིང་བ་འཐུབ་པའོ།
en: They have cut through the bondage of wrong views.

source: །འཁོར་བའི་གྲོང་ཁྱེར་ནས་འདོན་པའོ།
en: They have left the city of saṃsāra.

source: །འཇིག་རྟེན་གྱི་གནས་འདོར་བར་བྱེད་པའོ།
en: They have discarded worldly states.

source: །བདུད་ཀྱི་ཞགས་པ་ལས་ཐར་བར་བྱེད་པའོ།
en: They have become free from the noose of Māra

source: །སྡུག་བསྔལ་གྱི་ཟུག་རྔུ་འབྱིན་པའོ།
en: They have pulled out the splinter of suffering.

source: །མི་ཤེས་པའི་ཐིབས་པ་ལས་ཐར་བར་བྱེད་པའོ།
en: They have been liberated from the wasteland of unknowing.

source: །ལྟ་བའི་མྱ་ངན་ལས་ཡོངས་སུ་ཟློ་བའོ།
en: They have eliminated the misery of wrong views.

source: །སྲིད་པའི་ཆུ་བོ་ལས་སྒྲོལ་བའོ།
en: They are freed from the river of existence.

source: །འདོད་པའི་འདམ་ནས་འབྱིན་པའོ།
en: They are extracted from the swamp of desire.

source: །ལམ་མི་བདེ་བ་ནས་རྣམ་པར་ཟློག་པའོ།
en: They have turned away from paths to unhappiness.

source: །བྱང་ཆུབ་སེམས་དཔའི་ལམ་ཡང་དག་པར་སྟོན་པའོ།
en: They teach the path of the bodhisattvas.

source: །བྱང་ཆུབ་སེམས་དཔའི་ཡི་དམ་ལ་གཞོག་པའོ།
en: They maintain the resolve of the bodhisattva.

source: །ནན་ཏན་ལ་རབ་ཏུ་འགོད་པའོ།
en: They establish others in practice.

source: །ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་འགྲོ་བའི་ཕྱོགས་རབ་ཏུ་སྟོན་པའོ།
en: They teach the direction for going to omniscience.

source: །ཤེས་རབ་ཀྱི་མིག་རྣམ་པར་སྦྱོང་བའོ།
en: They purify the eyes of wisdom.

source: །བྱང་ཆུབ་ཀྱི་སེམས་རྣམ་པར་འཕེལ་བར་བྱེད་པའོ།
en: They increase the aspiration to enlightenment.

source: །སྙིང་རྗེ་ཆེན་པོ་ཡང་དག་པར་སྐྱེད་པའོ།
en: They give rise to great compassion.

source: །སྤྱོད་པ་ཡོངས་སུ་སྟོན་པའོ།
en: They teach the conduct.

source: །ཕ་རོལ་ཏུ་ཕྱིན་པའི་གདམས་ངག་རབ་ཏུ་སྟོན་པའོ།
en: They teach the instructions for the perfections.

source: །ས་ལ་རབ་ཏུ་འགོད་པའོ།
en: They establish others on the bhūmis.

source: །བཟོད་པ་རྣམ་པར་འབྱེད་པའོ།
en: They elucidate patience.

source: །དགེ་བའི་རྩ་བ་ཐམས་ཅད་ཡོངས་སུ་འགྲུབ་པར་བྱེད་པའོ།
en: They cause the accomplishment of all roots of merit.

source: །ཚོགས་ཐམས་ཅད་སྐྱེད་པར་བྱེད་པའོ།
en: They cause the development of all accumulations.

source: །བྱང་ཆུབ་སེམས་དཔའི་ཡོན་ཏན་ཐམས་ཅད་སྟོབས་པའོ།
en: They bestow all the bodhisattva qualities.

source: །སངས་རྒྱས་ཐམས་ཅད་ཀྱི་ཞབས་ཀྱི་དྲུང་དུ་ཕྱིན་པར་བྱེད་པའོ།
en: They enable going to the feet of all buddhas.

source: །ཡོན་ཏན་ཐམས་ཅད་ཡོངས་སུ་སྟོན་པའོ།
en: They teach all qualities.

source: །དོན་ཐམས་ཅད་ཡང་དག་པར་ལེན་དུ་འཇུག་པའོ།
en: They bring the acquisition of all benefits.

source: །ནན་ཏན་ལ་གཟེངས་བསྟོད་པའོ།
en: They inspire practice.

source: །འབྱུང་བའི་སྒོ་སྟོན་པའོ།
en: They reveal the door to setting forth.

source: །ལམ་གོལ་བ་ལས་ཡོངས་སུ་སྲུང་བའོ།
en: They guard others from taking wrong paths.

source: །ཆོས་སྣང་བའི་སྒོ་སྣང་བར་བྱེད་པའོ།
en: They bring illumination from the gateways to the light of the Dharma.

source: །ཆོས་ཀྱི་སྒོ་མངོན་པར་བརླན་པར་བྱེད་པའོ།
en: They bring saturation from the doors of the Dharma.

source: །ཆོས་ཐོས་པར་བྱ་བའི་སྤྲིན་གྱི་ཆར་རབ་ཏུ་འབེབས་པའོ།
en: They send down a rain from clouds of hearing the Dharma.

source: །ཉོན་མོངས་པ་ཐམས་ཅད་ཞི་བར་བྱེད་པའོ།
en: They cause all kleśas to cease.

source: །ལྟ་བའི་རྣམ་པ་ཐམས་ཅད་ལས་རྣམ་པར་ཟློག་པའོ།
en: They turn others away from all wrong views.

source: །སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་ལ་གནས་པར་བྱེད་པའོ།
en: They establish others in all the Dharmas of the buddhas.

source: །འདི་ལྟར་ཡང་རིགས་ཀྱི་བུ་དགེ་བའི་བཤེས་གཉེན་ནི་སངས་རྒྱས་ཀྱི་རིགས་སུ་སྐྱེས་པས་མ་ལྟ་བུའོ།
en: “Noble one, in that way, the kalyāṇamitras are like mothers because they give birth to the family of the buddhas.

source: །དགེ་བའི་བཤེས་གཉེན་ནི་ཕན་པ་རྒྱ་ཆེན་པོར་སྒྲུབ་པས་ཕ་ལྟ་བུའོ།
en: The kalyāṇamitras are like fathers because they accomplish great benefits.

source: །དགེ་བའི་བཤེས་གཉེན་ནི་སྡིག་པ་ཐམས་ཅད་ལས་སྲུང་བས་མ་མ་ལྟ་བུའོ།
en: The kalyāṇamitras are like nannies because they guard from all bad actions.

source: །དགེ་བའི་བཤེས་གཉེན་ནི་བྱང་ཆུབ་སེམས་དཔའི་བསླབ་པ་ཁོང་དུ་ཆུད་པར་བྱེད་པས་སློབ་དཔོན་ལྟ་བུའོ།
en: The kalyāṇamitras are like teachers because they bring understanding of bodhisattva training.

source: །དགེ་བའི་བཤེས་གཉེན་ནི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་ལམ་དུ་འཛུད་པས་ལམ་མཁན་ལྟ་བུའོ།
en: The kalyāṇamitras are like guides because they bring others onto the bodhisattva path.

source: །དགེ་བའི་བཤེས་གཉེན་ནི་ཉོན་མོངས་པའི་ནད་ལས་ཐར་བར་བྱེད་པས་སྨན་པ་ལྟ་བུའོ།
en: The kalyāṇamitras are like doctors because they free others from the illness of the kleśas.

source: །དགེ་བའི་བཤེས་གཉེན་ནི་ཡེ་ཤེས་ཀྱི་སྨན་རྣམ་པར་འཕེལ་བར་བྱེད་པས་གངས་རི་ལྟ་བུའོ།
en: The kalyāṇamitras are like the Himalayas because they multiply the medicinal herbs of wisdom.

source: །དགེ་བའི་བཤེས་གཉེན་ནི་འཇིགས་པ་ཐམས་ཅད་ལས་སྲུང་བས་དཔའ་བོ་ལྟ་བུའོ།
en: The kalyāṇamitras are like heroes because they guard from all fears.

source: །དགེ་བའི་བཤེས་གཉེན་ནི་འཁོར་བའི་ཆུ་བོ་ཆེན་པོ་ལས་སྒྲོལ་བས་མཉན་པ་ལྟ་བུའོ།
en: The kalyāṇamitras are like ferry captain because they bring others across the great river of saṃsāra.

source: །དགེ་བའི་བཤེས་གཉེན་ནི་ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་རིན་པོ་ཆེའི་གླིང་དུ་ཕྱིན་པར་བྱེད་པས་སྐྱབ་འཛིན་པ་ལྟ་བུའོ།
en: The kalyāṇamitras are like sea captains because they take others to the island of the jewels of omniscient wisdom.

source: །རིགས་ཀྱི་བུ་དེ་ལྟ་བས་ན་དེ་ལྟར་ཡིད་ལ་བྱ་བ་རྒྱུན་མ་ཆད་པས་ཁྱོད་ཀྱིས་དགེ་བའི་བཤེས་གཉེན་བསྙེན་པར་གྱིས་ཤིག །ཁུར་ཐམས་ཅད་བཀུར་བས་ཡོངས་སུ་མི་སྐྱོ་བའི་ཕྱིར་ས་ལྟ་བུའི་སེམས་དང་། མི་ཕྱེད་པའི་ཕྱིར་རྡོ་རྗེ་ལྟ་བུའི་སེམས་དང་སྡུག་བསྔལ་ཐམས་ཅད་ཀྱིས་མི་སྒུལ་བའི་ཕྱིར་འཁོར་ཡུག་ལྟ་བུའི་སེམས་དང་། ཅི་དགའ་བར་བཀའ་ཉན་པས་བྲན་ལྟ་བུའི་སེམས་དང་། ངག་ཐམས་ཅད་མི་གཅག་པས་སློབ་མ་ལྟ་བུའི་སེམས་དང་། ལས་ཐམས་ཅད་ཉམས་སུ་བླང་བ་ལ་མི་སྨད་པས་འཇིག་རྟེན་གྱི་བྲན་ལྟ་བུའི་སེམས་དང་། ཉོན་མོངས་པ་ཐམས་ཅད་ཀྱིས་མི་སྐྱོ་བའི་ཕྱིར་མ་མ་ལྟ་བུའི་སེམས་དང་། བྱའོ་ཅོག་ལ་མཐུན་པར་གཟུང་བས་གཡོག་ལྟ་བུའི་སེམས་དང་། ང་རྒྱལ་དང་མཐོ་བའི་ང་རྒྱལ་སྤོང་བས་ཕྱག་དར་བ་ལྟ་བུའི་སེམས་དང་། དུས་དང་དུས་མ་ཡིན་པར་མཐོན་དམན་དུ་འགྱུར་བས་ཟླ་བ་ཉ་བ་ལྟ་བུའི་སེམས་དང་། མྱི་སྲུན་པ་ཐམས་ཅད་རྣམ་པར་སྤོང་བས་རྟ་ཅང་ཤེས་ལྟ་བུའི་སེམས་དང་། ཁུར་ལྕི་བ་བཀུར་བས་ཐེག་པ་ལྟ་བུའི་སེམས་དང་། དུལ་བ་དང་ཅང་ཤེས་ཀྱི་བསམ་པས་གླང་པོ་ལྟ་བུའི་སེམས་དང་། མྱི་སྒུལ་མྱི་བསྐྱོད་པས་རི་ལྟ་བུའི་སེམས་དང་། མི་ཁྲོ་བས་ཁྱི་ལྟ་བུའི་སེམས་དང་། ང་རྒྱལ་དང་དུས་མེད་པས་གདོལ་བ་ལྟ་བུའི་སེམས་དང་། དྲེགས་པ་ཐམས་ཅད་མེད་པས་ཁྱུ་མཆོག་རྭ་བཅད་པ་ལྟ་བུའི་སེམས་དང་། རློམ་སེམས་མེད་པས་མཚན་བུ་ལྟ་བུའི་སེམས་དང་། འགྲོ་ཞིང་འོང་བས་མི་སྐྱོ་བས་གྲུ་ལྟ་བུའི་སེམས་དང་། དགེ་བའི་བཤེས་གཉེན་གྱི་ངག་གི་མཐར་ཕྱིན་པར་བྱེད་པས་ཟམ་པ་ལྟ་བུའི་སེམས་དང་། དགེ་བའི་བཤེས་གཉེན་གྱི་ངོར་བལྟ་བས་བུ་མཛངས་པ་ལྟ་བུའི་སེམས་དང་། ཆོས་ཀྱི་རྒྱལ་པོའི་བཀའ་ལས་མི་འགལ་བར་བྱ་བས་རྒྱལ་པོ་གཞོན་ནུ་ལྟ་བུའི་སེམས་ཀྱིས་དགེ་བའི་བཤེས་གཉེན་ལ་བསྙེན་པར་བྱའོ།
en: “Noble one, you should approach the kalyāṇamitras continuously, thinking in this way: You should approach the kalyāṇamitras with a mind like the earth for carrying all burdens without weariness, with a mind like a vajra because it is indestructible, with a mind like the Cakravāla mountain range because it is unaffected by any suffering, with a mind like a slave because it gladly obeys, with a mind like a pupil because it does not disobey instructions, with a mind like a slave of the world because it takes on all tasks without resentment, with a mind like a nanny because it is unwearied by any kleśa, with a mind like a servant because it is prepared to do any kind of work, with a mind like a street sweeper because it is devoid of pride and arrogance, with a mind like a full moon because it is lofty at the appropriate time and low at the inappropriate time, with a mind like a thoroughbred stallion because it is devoid of unruliness, with a mind like a carriage because it can carry a heavy load, with a mind like an elephant because it is tamed and well bred, with a mind like a mountain because it is immovable and unshakable, with a mind like a dog because it is not angered, with a mind like a caṇḍāla because it is without pride or egoism, with a mind like a hornless bull because it is without arrogance, with a mind like an in-house pupil because it has no haughtiness, with a mind like a boat because it is unwearied by coming and going, with a mind like a bridge because it reaches the conclusion of the kalyāṇamitra’s instruction, with a mind like an excellent son because it looks up at the face of the kalyāṇamitra, and with a mind like a prince because it does not disobey the king of the Dharma.

source: །རིགས་ཀྱི་བུ་ཁྱོད་ཀྱིས་བདག་ལ་ནི་ནད་པར་འདུ་ཤེས་བསྐྱེད་དོ། །དགེ་བའི་བཤེས་གཉེན་ལ་ནི་སྨན་པའི་འདུ་ཤེས་དང་། གདམས་ངག་ལ་ནི་སྨན་གྱི་འདུ་ཤེས་དང་། ནན་ཏན་ཉམས་སུ་བླང་བ་ལ་ནི་ནད་འཚོ་བའི་འདུ་ཤེས་བསྐྱེད་པར་བྱའོ། །རིགས་ཀྱི་བུ་ཁྱོད་ཀྱིས་བདག་ལ་ནི་དྲོན་པོའི་འདུ་ཤེས་བསྐྱེད་པར་བྱའོ།
en: “Noble one, you should think of yourself as a sick person, think of the kalyāṇamitra as a doctor, think of the instructions as medicine, and think of dedication to their practice as being healed from illness.

source: །དགེ་བའི་བཤེས་གཉེན་ལ་ནི་ལམ་མཚོན་པའི་འདུ་ཤེས་དང་། གདམས་ངག་ལ་ནི་ལམ་གྱི་འདུ་ཤེས་དང་། ནན་ཏན་ལ་ནི་ཕྱོགས་བདེ་བར་འགྲོ་བའི་འདུ་ཤེས་བསྐྱེད་པར་བྱའོ།
en: “Noble one, you should think of yourself as a traveler, think of the kalyāṇamitra as a guide, think of the instructions as the path, and think of their practice as traveling safely.

source: །རིགས་ཀྱི་བུ་ཁྱོད་ཀྱིས་བདག་ལ་ནི་ཕ་རོལ་ཏུ་འགྲོ་བའི་འདུ་ཤེས་བསྐྱེད་པར་བྱའོ། །དགེ་བའི་བཤེས་གཉེན་ལ་ནི་མཉན་པའི་འདུ་ཤེས་དང་། རྗེས་སུ་བསྟན་པ་ལ་མུ་སྟེགས་ཀྱི་འདུ་ཤེས་དང་། ནན་ཏན་ལ་ནི་གྲུའི་འདུ་ཤེས་བསྐྱེད་པར་བྱའོ།
en: “Noble one, you should think of yourself as someone crossing to the opposite shore, think of the kalyāṇamitra as a ferry captain, think of the teachings as the jetty, and think of their practice as the boat.

source: །རིགས་ཀྱི་བུ་ཁྱོད་ཀྱིས་བདག་ལ་ནི་ཞིང་པའི་འདུ་ཤེས་བསྐྱེད་པར་བྱའོ། །དགེ་བའི་བཤེས་གཉེན་ལ་ནི་ཀླུའི་དབང་པོའི་འདུ་ཤེས་དང་། གདམས་ངག་ལ་ནི་ཆར་པའི་འདུ་ཤེས་དང་། ནན་ཏན་ལ་ནི་ལོ་ཏོག་འགྲུབ་པའི་འདུ་ཤེས་བསྐྱེད་པར་བྱའོ།
en: “Noble one, you should think of yourself as a farmer, think of the kalyāṇamitra as a nāga lord, think of the instructions as rain, and think of their practice as cultivating a harvest.

source: །རིགས་ཀྱི་བུ་ཁྱོད་ཀྱིས་བདག་ལ་ནི་དབུལ་པོའི་འདུ་ཤེས་བསྐྱེད་པར་བྱའོ། །དགེ་བའི་བཤེས་གཉེན་ལ་ནི་ངལ་བསོ་པོའི་འདུ་ཤེས་དང་། གདམས་ངག་ལ་ནི་ནོར་དང་དོན་གྱི་འདུ་ཤེས་དང་། ནན་ཏན་ལ་ནི་དབུལ་བ་སེལ་བའི་འདུ་ཤེས་བསྐྱེད་པར་བྱའོ།
en: “Noble one, you should think of yourself as a poor person, think of the kalyāṇamitra as Vaiśravaṇa, think of the instructions as wealth and gifts, and think of their practice as becoming free from poverty.

source: །རིགས་ཀྱི་བུ་ཁྱོད་ཀྱིས་བདག་ལ་ནི་སློབ་མའི་འདུ་ཤེས་བསྐྱེད་པར་བྱའོ། །དགེ་བའི་བཤེས་གཉེན་ལ་ནི་སློབ་དཔོན་གྱི་འདུ་ཤེས་དང་གདམས་ངག་ལ་ནི་བཟོ་བའི་འདུ་ཤེས་དང་། ནན་ཏན་ལ་ནི་བཟོ་ཁོང་དུ་ཆུད་པའི་འདུ་ཤེས་བསྐྱེད་པར་བྱའོ།
en: “Noble one, you should think of yourself as a pupil, think of the kalyāṇamitra as a teacher, think of the instructions as the arts, and think of their practice as learning the arts.
